{"title":"About","slug":"about","content":"I’ve been obsessed with technology and building things all my life. I feel very lucky to do what is essentially my #1 hobby for a living.\n\nI graduated from a BSc in Web Development from MMU in 2015 and joined Co-op Digital. I was doing design and front-end until 2017, then joined the engineering team learning Python and Django.\n\nTalking at Wills end of beta show and tell\n\nI’ve had a lot of weird tech jobs in my life but those are for another blog post. For now, I’ll just ramble about what I’ve got up to at Co-op Digital so far:\n\n    I’ve worked on our ‘pattern lab’ Alpha, essentially digitising the new brand that went out in 2016. This eventually became the Design Manual\n\n    I built the front-end of the Wills service and some of my components ended up in the design manual to be used across the Co-op digital portfolio\n\n    I wrote our accessibility guidelines\n\n    I do talks for various schools and codeclubs around Manchester\n\n    I help to organise an accessibility meet-up, Open, with some colleagues\n\n    I was part of the Co-op team at HackManchester and came 2nd\n\n    I moved over from the design & front-end team and started learning Python & Django on a legit award winning team inside Co-ops Funeralcare business in 2017. Never thought I’d win a trophy (well, 2 actually) in this world\n\nI’m now (February 2018) in the Co-op Digital Publishing Services team where we’re creating a product/process for people across the entire Co-op business to publish web content efficiently and effectively. First time I’ve worked in a Full Stack capacity on a team, I do all sorts!\n\nI consider myself a lifelong learner and anything tech fascinates me. I adore my craft and although I feel like I know literally nothing sometimes due to not being in this world long, I’m always learning. LEARN ALL THE THINGGGGSSS!\nOutside of work\n\nI love cycling and have built myself a Fixed Gear and a Road bike from scratch. I’m a tiny human and well, like building things. None of the off the peg bikes really fit me so occasionally I’ll casually turn my flat into a workshop. I’d love to get a custom frame made up one day.\n\nI also play guitar and bass. I played bass in a few bands back in the day but I mostly play guitar now. Coincidentally I also built a Partscaster.\n\nI’m also an avid PC gamer and used to play Counter-Strike semi-professionally back in the day 😅. You guessed it, I build my own computers too.\n\nI’m also very passionate about the environment & animal rights.","dateLastEdited":"2019-10-29T00:00+01:00"}