[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"rbg3jyy5o9f7"}},"id":"4NY80q4WHwhynpKbvMOjyy","type":"Entry","createdAt":"2019-10-18T19:09:54.317Z","updatedAt":"2019-10-23T12:04:50.849Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":9,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"blogPost"}},"locale":"en-US"},"fields":{"title":"Building a Mechanical Keyboard part 1: requirements","datePublished":"2018-02-10","slug":"building-a-mechanical-keyboard-part-1","headlineImage":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"rbg3jyy5o9f7"}},"id":"7Ac4M2MHGSS17RrtIjEe9e","type":"Asset","createdAt":"2019-10-23T12:02:51.121Z","updatedAt":"2019-10-23T12:02:51.122Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"locale":"en-US"},"fields":{"title":"mech-board-p1-headline-image","file":{"url":"//images.ctfassets.net/rbg3jyy5o9f7/7Ac4M2MHGSS17RrtIjEe9e/56649e4356c123c0a121fcd3a7cc3474/mech-board-p1-headline-image.png","details":{"size":10928,"image":{"width":1106,"height":422}},"fileName":"mech-board-p1-headline-image.png","contentType":"image/png"}}},"tags":["Making","Electronics","Soldering","Keyboards"],"content":"I just really love mechanical keyboards.\n\n\n> \"Cowboys in the western United States leave their horses when they die. But never leave their saddles, regardless of how long they need to walk in the desert. Saddles are interfaces that are deeply adapted to our bodies whereas horses are consumable items. It should not be forgotten that computers are consumables nowadays, but keyboards are interfaces that we can use through our lives.” - Professor Eiiti Wada, [Designer of the Happy Hacking Keyboard](https://www.hhkeyboard.com/history/)\n\nDon't agree with your stance on Horses, Prof, but I have no doubt your keyboard would be a trusty steed.\n\n## The Happy Hacking Keyboard (HHKB)\n\nDespite not having one, I reckon the [HHKB](http://www.keyboard-layout-editor.com/#/gists/ca2429e3996c9a1a4cefead61b6b21eb) is my dream layout. I've always had Caps-lock remapped to Control. I get on perfectly fine with 60% keyboard - even for programming & gaming. I'm a fan of minimalism and this keyboard epitomises it.\n\nSo why don't I just buy one? Well, a number of reasons:\n\n1. It's £259 in the UK and [you can only get it in Black over here](https://www.hhkeyboard.com/)\n2. I'm not sure about Topre switches. I'm sure they'd be great to avoid fatigue but it's not a truly mechanical feel\n3. IT'S NEARLY THREE HUNDRED POUNDS\n4. There are complaints on Reddit about the build quality for such an expensive keyboard (too much flex etc)\n5. IT'S £259 AND I COULD HAVE THE JOY OF BUILDING IT FOR LESS THAN THAT\n6. The USB hub is pretty much useless (100mA) and I don't want one in my keyboard anyway\n\nI'll no doubt end up owning one eventually because that #keeblyf. But for now, I'm going to make one similar.\n\n\n## Build requirements\n\n#### It needs to be light\n\nI lug a Magicforce 68 to work everyday and it weighs about 600g. Light, but could be lighter. The Magicforce has an Aluminum plate so I can shave off some grams by using an Acrylic plate in this build.\n\n#### It needs to be quiet\n\nI have Cherry Browns with PBT keycaps at work and no-ones Shuriken'd their Magic Mouse at me yet so I think this set-up is quiet enough.\n\nHowever, I may go for a lighter switch like Clears (35g actuation force rather than Browns 45g). These will be a little quieter and the lower force required to actuate the keypress will reduce typing fatigue. Worried about typing accuracy with lighter switches though, I need to do more research.\n\n#### A fully programmable PCB\n\nThis is needed to achieve the true HHKB Layout and will allow the PCB to be recycled into another build if I get bored of this one. Also, more excuses to write code!\n\n\n#### Everything sourced in the UK\n\nI really hate flying small electronics halfway across the world.\n\n\n## The build\n\nThere's only one kit widely available for a HHKB layout and it [looks pretty naff](https://mechboards.co.uk/shop/all/hhkb-diy-kit/) in my opinion.\n\nMy plan is to get a custom plate made then purchase the PCB and a Poker-style 60% case to put everything in.\n\nSwitches and keycaps will come later because I'll no doubt be deliberating over them for weeks.\n\n### The Plate\n\nThe plate is what the switches will clip into and forms the top of the keyboard case. I couldn't find one anywhere in HHKB layout. It's Maker time!\n\nI found the HHKB layout on the [Keyboard Layout Editor tool](http://www.keyboard-layout-editor.com/#/gists/ca2429e3996c9a1a4cefead61b6b21eb).\n\nI could export the raw data from that tool and plug it straight into the awesome [Plate & Case Builder tool](http://builder.swillkb.com/). This will generate the CAD file that can go straight to a lab to be laser cut.\n\n_Urgh, I love the Internet._\n\n#### Getting the plate made\n\nA company called [Ponoko](http://www.ponoko.com/home) was recommended by the Interwebz but they're based in the USA and ain't nobody got time for that (and it'd break one of my requirements).\n\nAfter some digging, I found a company called [Razorlab](http://www.razorlab.co.uk/) that're based in the UK who seem to be owned by Ponoko. Best of both worlds!\n\nAll I needed to do now was upload the generated CAD .eps from the Plate & Case Builder tool and as if by magic it'll arrive in my postbox soon.\n\nI did have to faff about a bit with their tool and go back and regenerate the CAD file to change the cut lines to Blue and the line weight to .01mm. They have helpful error messages though so it wasn't too bad. It also looks like they have the option to email a proper CAD person to get advice on your build too which is pretty cool!\n\nThis turned out to cost me £26.27 which was a little pricier than I expected. I think that has something to do with having to choose 'P2' size Acrylic because the 'P1' was 3mm too small (_urgh_) for my schematic. I hope they recycle the cut offs and don't just send me a random bag of Black Acrylic!\n\nI think I'll start getting involved in a Hackspace as I'm bound to be doing more of this sort of thing in the future.\n\n## and now we wait!\n\nIt's my first time using a Maker service like Razorlab or doing anything CAD related really. I'm going to wait and see how the plate turns out\nbefore buying anything else.\n\nNow to obsess over switches and keycaps...\n\n**Update: see [part two of this series](/post?slug=building-a-mechanical-keyboard-part-2))!**"}},{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"rbg3jyy5o9f7"}},"id":"2b1CWX4RDPp3FiRoZvxXYG","type":"Entry","createdAt":"2019-10-19T10:53:29.870Z","updatedAt":"2019-10-23T12:11:50.101Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":20,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"blogPost"}},"locale":"en-US"},"fields":{"title":"Building a Mechanical Keyboard part 2: the build","datePublished":"2018-04-06","slug":"building-a-mechanical-keyboard-part-2","headlineImage":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"rbg3jyy5o9f7"}},"id":"5fpG59MtdzzscgpJdNb1xy","type":"Asset","createdAt":"2019-10-23T12:02:57.825Z","updatedAt":"2019-10-23T12:02:57.825Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"locale":"en-US"},"fields":{"title":"mech-board-p2-headline-image","file":{"url":"//images.ctfassets.net/rbg3jyy5o9f7/5fpG59MtdzzscgpJdNb1xy/d9fde032c0827c20d3a91dee682641b0/mech-board-p2-headline-image.jpg","details":{"size":43555,"image":{"width":995,"height":516}},"fileName":"mech-board-p2-headline-image.jpg","contentType":"image/jpeg"}}},"tags":["Keyboards","Electronics","Soldering","Making"],"content":"This post follows on from [part one of this series](/post?slug=building-a-mechanical-keyboard-part-1).\n\nThis build has taken forever. My original plan was to have everything sourced in the UK. Alas, whilst there are some brilliant shops based in the UK, they didn't have exactly what I need due to the layout I was after and the rarer, heavier switches I wanted.\n\nIt's been fun and I'm typing this on the very keyboard I'm writing about. Read on to hear more about my new prized possession.\n\n## What I eventually ended up with\nThese links are from the actual companies I bought stuff from. No affiliate links.\n\n### The PCB\nI went with the [DZ60 PCB](https://kbdfans.myshopify.com/products/dz60-60-pcb) because of the sheer amount of layouts it can support:\n\n<figure>\n![possible dz60 pcb layouts](//images.ctfassets.net/rbg3jyy5o9f7/1W6Gx4M3uYmEDkBoL02Sg4/eda9e7c7505ca5e0f33edfc2b604d361/dz60-pcb.jpg)\n<figcaption>The possible DZ60 PCB layouts</figcaption>\n</figure>\n\n\nIt uses a ATMega32u4 Microcontroller which is a pretty standard Atmel chip (for future potential hacking) and also supports QMK firmware. QMK is the go-to in DIY mechanical keyboards and is extensively documented.\n\nOh & always remember to test your PCB before soldering no matter how shonky your method is (try not to stab yourself with Needle-nosed Tweezers as much as I did):\n\n\n<blockquote class=\"twitter-tweet\" data-lang=\"en-gb\"><p lang=\"en\" dir=\"ltr\">TIL needle nose tweezers are good for something other than accidentally stabbing yourself. My keyboards PCB works yisssss <a href=\"https://twitter.com/hashtag/mechanicalkeyboards?src=hash&amp;ref_src=twsrc%5Etfw\">#mechanicalkeyboards</a> <a href=\"https://t.co/EHjfw7ciOX\">pic.twitter.com/EHjfw7ciOX</a></p>&mdash; ☠️🎃 Rebecca Errorsmith 🎃☠️ (@beckycodes) <a href=\"https://twitter.com/beckycodes/status/971376274546536448?ref_src=twsrc%5Etfw\">7 March 2018</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n\n\n### The Plate (epic fail #1)\nI should have thought more about the custom plate.\n\nThe highlight of my [first post](http://becky.codes/blog/building-a-mechanical-keyboard-part-1/) was about using the various online tools the mechanical keyboard community have created to easily draw up a plate for my custom layout (a CAD file basically). All well and good, if your switches actually clip into it. I made the mistake of going for 3mm Acrylic when I had mine made. The spec for the switch housing only allowed for 1.4mm. I could have glued the switches in but I wanted this to be a proper endgame keyboard and didn't want to have any bodges.\n\nInstead, I went for [this plate](https://1upkeyboards.com/diy-60-brass-plate-kits.html) from 1UP keyboards. It was pretty pricey and I had to pay ~£15 in import charges but I figure a big hunk of Brass will probably outlive me. Even if I ended up making a new keyboard, this plate can be easily recycled into another build because it's my ideal layout.\n\n## Switches\nI have read about switches far more than any normal person will in their life. There are 100s of switches available to you. I thought the choice was basically Cherry, Gateron or Topre. Oh no. In fact, this keyboard has ended up with three different switches in it.\n\nMy aim with the feel of this keyboard is accuracy and quiet. I will be writing code and it needs to not annoy my colleagues.\n\nI had a look at all the different 'silent' switches available and then realised I'm actually quite a heavy typist so I should probably use heavier switches to avoid the keycaps bottoming out on the plate.\n\nIn typical style I've took this to the extreme and the keyboard now has a mix of Zealio 78g on the Alphas, 100g Aliaz Silents on the keys I tend to smash (tab, space) and Gateron Black 75g everywhere else. The gram measure is equal to the bottom out force. For comparison, a MacBook chiclet key is around 30g.\n\n<figure>\n![soldering the switches in](//images.ctfassets.net/rbg3jyy5o9f7/1y9WCpZXvPzmngFSMWdGwg/f6d970bb874d1fb54c724440af96ee28/soldering-switches.jpg)\n  <figcaption>You can see where the different switches go here. Proper custom.</figcaption>\n</figure>\n\nIt feels bloody great. I was worried about typing fatigue but it feels fine so far. The heavy switches have helped with my accuracy too. I also hand lubed all the switches. I almost omitted that because using 4 hours of your life to paint some lube on switches is probably a bit weird but it's definitely helped with the feel of the board.\n\n## Case\nThe case was an easy choice & thankfully very cheap unlike everything else for this keyboard. I just wanted something light that I could access the reset button on the PCB through. It's just a [simple plastic thing with no feet](https://kbdfans.myshopify.com/products/60-plastic-case). Luckily it's at the perfect angle and height for me.\n\n## Keycaps\nI knew exactly what I wanted the keyboard to look like when I embarked on this project. I wanted it dark but with big readable legends so my pairing partners never had to hunt for keys if they wanted to drive using this keyboard (I usually have side print or blank keycaps). I went for DSA profile keycaps to further increase accuracy too. They're also really thick and are very satisfying to type on. I stuck some CMYK keycaps from a different mold on there (making keycap purists cry in the process) but I think it looks cool af.\n\n<figure>\n![The complete keyboard](//images.ctfassets.net/rbg3jyy5o9f7/NNMVuWOx3A7rw507YV8f0/127c78a6297f3c5252b72790c4c66035/completed-keyboard.jpg)\n  <figcaption>Just look at it 😍</figcaption>\n</figure>\n\n## Done\nThere's less images than I planned in this post. Most parts arrived as a bit of a surprise on the Saturday of the Easter Bank Holiday weekend and in my excitement I went wild and built it there and then. This was never meant to be a complete build guide because there are plenty of those on the internet. If you have any questions or want to see anything specific I'm always very happy to chat about keebs!\n"}}]