[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"rbg3jyy5o9f7"}},"id":"4NY80q4WHwhynpKbvMOjyy","type":"Entry","createdAt":"2019-10-18T19:09:54.317Z","updatedAt":"2019-10-18T19:11:38.287Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"blogPost"}},"locale":"en-US"},"fields":{"title":"Building a Mechanical Keyboard part 1: requirements","slug":"building-a-mechanical-keyboard-part-1","tags":["JavaScript"],"content":"I just really love mechanical keyboards.\n\n\n> \"Cowboys in the western United States leave their horses when they die. But never leave their saddles, regardless of how long they need to walk in the desert. Saddles are interfaces that are deeply adapted to our bodies whereas horses are consumable items. It should not be forgotten that computers are consumables nowadays, but keyboards are interfaces that we can use through our lives.” - Professor Eiiti Wada, [Designer of the Happy Hacking Keyboard](https://www.hhkeyboard.com/history/)\n\nDon't agree with your stance on Horses, Prof, but I have no doubt your keyboard would be a trusty steed.\n\n## The Happy Hacking Keyboard (HHKB)\n\nDespite not having one, I reckon the [HHKB](http://www.keyboard-layout-editor.com/#/gists/ca2429e3996c9a1a4cefead61b6b21eb) is my dream layout. I've always had Caps-lock remapped to Control. I get on perfectly fine with 60% keyboard - even for programming & gaming. I'm a fan of minimalism and this keyboard epitomises it.\n\nSo why don't I just buy one? Well, a number of reasons:\n\n1. It's £259 in the UK and [you can only get it in Black over here](https://www.hhkeyboard.com/)\n2. I'm not sure about Topre switches. I'm sure they'd be great to avoid fatigue but it's not a truly mechanical feel\n3. IT'S NEARLY THREE HUNDRED POUNDS\n4. There are complaints on Reddit about the build quality for such an expensive keyboard (too much flex etc)\n5. IT'S £259 AND I COULD HAVE THE JOY OF BUILDING IT FOR LESS THAN THAT\n6. The USB hub is pretty much useless (100mA) and I don't want one in my keyboard anyway\n\nI'll no doubt end up owning one eventually because that #keeblyf. But for now, I'm going to make one similar.\n\n\n## Build requirements\n\n#### It needs to be light\n\nI lug a Magicforce 68 to work everyday and it weighs about 600g. Light, but could be lighter. The Magicforce has an Aluminum plate so I can shave off some grams by using an Acrylic plate in this build.\n\n#### It needs to be quiet\n\nI have Cherry Browns with PBT keycaps at work and no-ones Shuriken'd their Magic Mouse at me yet so I think this set-up is quiet enough.\n\nHowever, I may go for a lighter switch like Clears (35g actuation force rather than Browns 45g). These will be a little quieter and the lower force required to actuate the keypress will reduce typing fatigue. Worried about typing accuracy with lighter switches though, I need to do more research.\n\n#### A fully programmable PCB\n\nThis is needed to achieve the true HHKB Layout and will allow the PCB to be recycled into another build if I get bored of this one. Also, more excuses to write code!\n\n\n#### Everything sourced in the UK\n\nI really hate flying small electronics halfway across the world.\n\n\n## The build\n\nThere's only one kit widely available for a HHKB layout and it [looks pretty naff](https://mechboards.co.uk/shop/all/hhkb-diy-kit/) in my opinion.\n\nMy plan is to get a custom plate made then purchase the PCB and a Poker-style 60% case to put everything in.\n\nSwitches and keycaps will come later because I'll no doubt be deliberating over them for weeks.\n\n### The Plate\n\nThe plate is what the switches will clip into and forms the top of the keyboard case. I couldn't find one anywhere in HHKB layout. It's Maker time!\n\nI found the HHKB layout on the [Keyboard Layout Editor tool](http://www.keyboard-layout-editor.com/#/gists/ca2429e3996c9a1a4cefead61b6b21eb).\n\nI could export the raw data from that tool and plug it straight into the awesome [Plate & Case Builder tool](http://builder.swillkb.com/). This will generate the CAD file that can go straight to a lab to be laser cut.\n\n_Urgh, I love the Internet._\n\n#### Getting the plate made\n\nA company called [Ponoko](http://www.ponoko.com/home) was recommended by the Interwebz but they're based in the USA and ain't nobody got time for that (and it'd break one of my requirements).\n\nAfter some digging, I found a company called [Razorlab](http://www.razorlab.co.uk/) that're based in the UK who seem to be owned by Ponoko. Best of both worlds!\n\nAll I needed to do now was upload the generated CAD .eps from the Plate & Case Builder tool and as if by magic it'll arrive in my postbox soon.\n\nI did have to faff about a bit with their tool and go back and regenerate the CAD file to change the cut lines to Blue and the line weight to .01mm. They have helpful error messages though so it wasn't too bad. It also looks like they have the option to email a proper CAD person to get advice on your build too which is pretty cool!\n\nThis turned out to cost me £26.27 which was a little pricier than I expected. I think that has something to do with having to choose 'P2' size Acrylic because the 'P1' was 3mm too small (_urgh_) for my schematic. I hope they recycle the cut offs and don't just send me a random bag of Black Acrylic!\n\nI think I'll start getting involved in a Hackspace as I'm bound to be doing more of this sort of thing in the future.\n\n## and now we wait!\n\nIt's my first time using a Maker service like Razorlab or doing anything CAD related really. I'm going to wait and see how the plate turns out\nbefore buying anything else.\n\nNow to obsess over switches and keycaps...\n\n**Update: see [part two of this series]({{site.url}}/blog/building-a-mechanical-keyboard-part-2/)!**"}},{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"rbg3jyy5o9f7"}},"id":"1jeGLMVdCF1VXI6RN28Pdd","type":"Entry","createdAt":"2019-09-02T15:44:40.520Z","updatedAt":"2019-09-03T17:45:09.743Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":2,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"blogPost"}},"locale":"en-US"},"fields":{"title":"Another post","slug":"another-post","tags":["JavaScript","Testing"],"content":"Another posts content"}},{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"rbg3jyy5o9f7"}},"id":"2618y6tTDbBbE6HOVVDi7A","type":"Entry","createdAt":"2019-07-30T20:08:58.693Z","updatedAt":"2019-09-03T19:07:08.044Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":7,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"blogPost"}},"locale":"en-US"},"fields":{"title":"Writing unittests with Jest in Next.js","slug":"writing-unittests-with-jest-in-nextjs","tags":["Testing"],"content":"Content lol"}}]